README.org
#+TITLE: Mètsàtron’s Literate Dotfiles Grimoire
#+AUTHOR: Mètsàtron — Sovereign Weaver
#+LANGUAGE: en
#+OPTIONS: toc:2 num:t
#+PROPERTY: header-args :mkdirp yes :results silent :comments both

* Modules at repo root
#+BEGIN: dotfiles-index :glob "*.org" :exclude "README.org"
- [[file:guix.org][guix]]
- [[file:shell.org][shell]]
- [[file:laincore.org][laincore]]
- [[file:flatpak-bridge.org][flatpak-bridge]]
- [[file:flatpak.org][flatpak]]
- [[file:x11.org][x11]]
- [[file:emacs.org][emacs]]
#+END:

* 🜂 Luminous Recap & Lineage
The *master.org* became the **Table of Cortex**, and now the living ship **HelmCortex** steers us.
This repository is the *literate recursion* of that lineage: each file carries code *and* memory.
We tangle source from these Org scrolls into overlay targets, preserving your canonical structure:
=all/ → os → distro → machine=. No files are removed by this ritual; we add clarity without erasing history.

* 🜃 How This Grimoire Works
#+TOC: headlines 2
** Overlays (unchanged, honored)
- =all/= shared everywhere
- =linux/=, =arch/=, =debian/=, =osx/= (choose one path by host)
- =think/=, =be/= (per-system overlays)

** Literate sources
Org files live alongside  =orgsrc/= and =<module>.org=. They *tangle* into existing paths
(e.g. =all/.bashrc=, =arch/.xinitrc=). This allows incremental adoption: keep your current files working while you migrate content.

** Stow ritual (priority order)
#+BEGIN_SRC sh
stow all linux debian think
# or, on a Mac:
# stow all osx
#+END_SRC

** Batch update: TOC → Tangle → Optional profile apply
Emacs in batch updates dynamic TOC blocks and tangles files. Targets below assume GNU Emacs is installed.

* Maak control plane (Scheme, XDG-friendly)
#+BEGIN_SRC scheme :tangle all/.config/maak/maak.scm :mkdirp yes
(use-modules (srfi srfi-1)
             (ice-9 popen) (ice-9 rdelim) (ice-9 match) (ice-9 pretty-print))

;; Run one shell string via bash -lc <cmd>, print stdout, return exit code.
(define (sh cmd)
  (let* ((p   (open-pipe* OPEN_READ "bash" "-lc" cmd))
         (out (read-string p))
         (ec  (close-pipe p)))
    (display out)
    ec))

(define (ok? code) (zero? code))
(define (task name desc thunk) (list name desc thunk))
(define (task-name t)  (list-ref t 0))
(define (task-desc t)  (list-ref t 1))
(define (task-thunk t) (list-ref t 2))

(define HOME (or (getenv "HOME") (error "HOME not set")))
(define CORE-PROFILE (string-append HOME "/.guix-extra-profiles/core/core"))

(define (with-core thunk)
  (let* ((cmd (string-append ". \"" CORE-PROFILE "/etc/profile\"; " (thunk))))
    (sh cmd)))

(define tasks
  (list
   (task 'list "List available tasks"
         (lambda ()
           (for-each (lambda (t) (format #t "~a\t~a~%" (task-name t) (task-desc t))) tasks)
           0))
   (task 'all "TOC → tangle → ensure Guix dirs" (lambda () (sh "make all")))
   (task 'stow "Safe stow (backup real files, then stow)" (lambda () (sh "make safe-stow")))
   (task 'profiles "Build core+dev profiles" (lambda () (sh "make guix-core guix-dev")))
   (task 'guix-core "Build core profile from manifest" (lambda () (sh "make guix-core")))
   (task 'guix-pull "guix pull (update channels)" (lambda () (sh "make guix-pull")))
   (task 'bridge "Apply Flatpak fonts/cursors bridge" (lambda () (sh "make bridge-flatpak")))
   (task 'x11-apply "Re-stow think/.xsessionrc & friends" (lambda () (sh "make x11-apply")))
   (task 'health "Show registrar, GTK module, and nvim path"
         (lambda ()
           (sh "pgrep -af appmenu-registrar || echo 'registrar: (none)'")
           (sh "printf 'GTK_MODULES=%s\\n' \"${GTK_MODULES:-}\"")
           (with-core (lambda () "command -v nvim; nvim --version | sed -n '1,2p'"))
           0))
   (task 'which-nvim "Show nvim location and version"
         (lambda ()
           (with-core (lambda () "command -v nvim; nvim --version | sed -n '1,2p'"))
           0))
   (task 'inkscape-timecapsule "Hint for running Inkscape from a past generation"
         (lambda ()
           (sh "guix describe --generations; echo 'Usage: guix time-machine --generation=N -- shell --pure inkscape -- inkscape'")
           0))
   ))

(define (mk-guix cmd) (sh (string-append "make -f " HOME "/.dotfiles/all/.mk/guix.mk " cmd)))

(define tasks
  (append tasks
          (list
           (task 'guix:dirs "Ensure ancillary Guix directories"
                 (lambda () (mk-guix "guix-dirs")))
           (task 'guix:pull "guix pull"
                 (lambda () (mk-guix "guix-pull")))
           (task 'guix:core "Build core profile from manifest"
                 (lambda () (mk-guix "guix-core")))
           (task 'guix:dev "Build dev profile (depends on core)"
                 (lambda () (mk-guix "guix-dev")))
           (task 'guix:gc "guix gc"
                 (lambda () (mk-guix "guix-gc")))
           )))

;; --- Flatpak control plane via loom ---
(define (mk cmd) (sh (string-append "make -f " HOME "/.dotfiles/all/.mk/flatpak.mk " cmd)))

(define tasks
  (append
   tasks
   (list
    (task 'flatpak:remotes "Ensure remotes (user+system) with clean env"
          (lambda () (mk "flatpak-remotes")))
    (task 'flatpak:capture "Capture live apps → linux/.flatpak/manifest/apps.tsv"
          (lambda () (mk "flatpak-capture")))
    (task 'flatpak:diff "Plan: desired (TSV) vs installed"
          (lambda () (mk "flatpak-diff")))
    (task 'flatpak:sync "Additive apply (no removals)"
          (lambda () (mk "flatpak-sync")))
    (task 'flatpak:apply "Enforce exact match (set ENFORCE/UNINSTALL/FO... vars as needed)"
          (lambda () (mk "flatpak-apply")))
    (task 'flatpak:perms-capture "Capture per-app permissions/overrides"
          (lambda () (mk "flatpak-perms-capture")))
    (task 'flatpak:perms-apply "Apply captured permissions/overrides"
          (lambda () (mk "flatpak-perms-apply")))
    )))

(define (run name)
  (let ((t (find (lambda (t) (eq? (task-name t) name)) tasks)))
    (if t ((task-thunk t))
        (begin (format #t "Unknown task: ~a\n" name) 1))))

;; main: accept either `loom list` or `guile -s ... -- list`
(define (main args)
  (let* ((rest (cdr args))                    ; drop program name
         (rest (if (and (pair? rest)
                         (string=? (car rest) "--"))
                    (cdr rest) rest)))
    (match rest
      (("list")        (run 'list))
      (("help")        (run 'list))
      ((cmd . _more)   (run (string->symbol cmd)))
      (_               (begin
                         (format #t "Usage: loom <task>\nTry: loom list\n")
                         1)))))
#+END_SRC

#+BEGIN_SRC bash :tangle all/.local/bin/loom :shebang "#!/usr/bin/env bash" :mkdirp yes
set -euo pipefail
CONF="${XDG_CONFIG_HOME:-$HOME/.config}/maak/maak.scm"
GUIX_GUILE="$HOME/.guix-extra-profiles/core/core/bin/guile"
export GUILE_AUTO_COMPILE=0
exec "$GUIX_GUILE" -e main -s "$CONF" "$@"
#+END_SRC

#+BEGIN_SRC org :tangle no
Usage:
  loom list
  loom all
  loom guix-core
  loom stow
  loom health
#+END_SRC

* 🛠️ Make Targets
#+BEGIN_SRC makefile :tangle Makefile :padline no :comments none
# -*- mode: makefile-gmake; indent-tabs-mode: t; tab-width: 8 -*-
.RECIPEPREFIX := |

EMACS ?= emacs
SCRIPT = all/.local/bin/dotfiles-batch.el
ROOT   = $(PWD)
GUIX ?= guix
GUIX_HOME := $(HOME)/.config/guix
EXTRA := $(HOME)/.guix-extra-profiles

# Stow packages you normally manage here
STOW_PKGS ?= all linux debian think

.PHONY: toc tangle all guix-pull guix-core guix-dev guix-gc guix-dirs \
        stow safe-stow x11-apply bridge-flatpak bridge-flatpak-reset preview-stow

EMACS_BATCH = $(EMACS) --batch -Q \
  --eval "(setq create-lockfiles nil make-backup-files nil auto-save-default nil backup-inhibited t vc-make-backup-files nil)"

toc:
| $(EMACS_BATCH) --eval '(load-file "$(SCRIPT)")' --eval '(dotfiles-batch-update "$(ROOT)")'

tangle:
| $(EMACS_BATCH) --eval '(load-file "$(SCRIPT)")' --eval '(dotfiles-batch-tangle "$(ROOT)")'

# all = toc → tangle → guix-dirs only
all: toc tangle guix-dirs

# Plain stow
stow:
| cd $(HOME)/.dotfiles && stow $(STOW_PKGS)

# Safe stow with timestamped backups of real files
safe-stow:
| cd $(HOME)/.dotfiles && \
| for pkg in $(STOW_PKGS); do \
|   stow -n $$pkg 2>&1 \
|     | sed -n 's/.*\* existing target is neither a link nor a directory: \(.*\)$$/\1/p' \
|     | while read -r t; do \
|         if [ -f "$(HOME)/$$t" ] && [ ! -L "$(HOME)/$$t" ]; then \
|           cp -a "$(HOME)/$$t" "$(HOME)/$$t.bak.$$(date +%Y%m%d-%H%M%S)"; \
|         fi; \
|       done; \
|   stow $$pkg; \
| done

preview-stow:
| cd $(HOME)/.dotfiles && stow -n $(STOW_PKGS) || true

# X11 apply for think overlay
x11-apply: tangle
| cd $(HOME)/.dotfiles && stow think
| @echo "✅ X11 applied."

#+END_SRC

** Guix, profiles, and when targets run
- =make all= runs only =toc → tangle → guix-dirs=. It does not build profiles.
- Run =make guix-core= whenever you change =all/.config/guix/manifests/core.scm=.
- If you really want profiles built on every =make all=, add =guix-core= to the dependencies of =all=. This repo uses explicit targets to avoid surprise rebuilds.

** Session wiring
Linux only.

- =linux/.xsessionrc.d/20-guix-core-profile.sh= loads the named core profile so GUI apps launched from menus see Guix paths.
- =linux/.config/environment.d/20-gtk-appmenu.conf= exports GTK AppMenu variable session wide on Linux, safe across DEs.
- Make them live with:
#+BEGIN_SRC sh
cd ~/.dotfiles && stow all linux debian think
logout
#+END_SRC

** Remove or change specs in =core.scm=
- Re-run:
#+BEGIN_SRC sh
make guix-core
guix gc
#+END_SRC
- The profile reconciles with the manifest. Removed specs are unlinked from that profile. Store bytes free on =guix gc=.

** Quick test commands
- Preview stow impact:
#+BEGIN_SRC sh
make preview-stow
#+END_SRC

- Check global menu stack is alive:
#+BEGIN_SRC sh
pgrep -af appmenu-registrar || echo "registrar missing"
echo "$GTK_MODULES"
#+END_SRC

* Dotfiles Make: targets, flow, and safety rails

#+begin_quote
“one command to weave them all.” — flat, clear, reproducible. this is the quick map.
#+end_quote

** Requirements
- GNU Make ≥ 3.82 (for =.RECIPEPREFIX=)
- Emacs (batch)
- GNU Stow
- Flatpak (for the bridge targets)
- Guix (optional: used by the =guix-*= targets)

** Global variables
These can be overridden per run (e.g. =EMACS=, =GUIX=):
- =EMACS=: default =emacs=
- =SCRIPT=: =all/.local/bin/dotfiles-batch.el=
- =ROOT=: repo root (=${PWD}=)
- =GUIX=: default =guix=
- =GUIX_HOME=: =~/.config/guix=
- =EXTRA=: =~/.guix-extra-profiles=

** Target overview (at a glance)

| Target                 | What it does                                                                                       |
|------------------------+-----------------------------------------------------------------------------------------------------|
| =toc=                  | Refresh Org dynamic blocks (table of contents / indexes) via batch Emacs.                          |
| =tangle=               | Tangle all code blocks from Org files into real files under =all/=, =linux/=, =debian/=, =think/=. |
| =guix-dirs=            | Ensure Guix ancillary dirs exist (runs =~/.local/bin/guix-mkdirs= if present).                     |
| =all=                  | Convenience: =toc → tangle → guix-dirs=.                                                            |
| =guix-pull=            | Run =guix pull=.                                                                                   |
| =guix-core=            | Build core profile from manifest after tangling; writes to =~/.guix-extra-profiles/core=.          |
| =guix-dev=             | Build dev profile (depends on =guix-core=).                                                        |
| =guix-gc=              | Run =guix gc=.                                                                                      |
| =safe-stow=            | **Safe stow**: previews conflicts, backs up real files with timestamp, then stows.                 |
| =preview-stow=         | Dry-run preview of what =stow= would touch (no changes).                                           |
| =bridge-flatpak=       | Tangle+stow, then apply **global Flatpak font/cursor bridge** overrides (dynamic cursors).         |
| =bridge-flatpak-reset= | Remove the global Flatpak overrides set by the bridge (non-destructive).                           |
| =x11-apply=            | Tangle+stow, then ensure merged =~/.xsessionrc= is in place.                                       |

** Typical flows

- Daily change
#+begin_src sh
make safe-stow
#+end_src

- After editing Org files
#+begin_src sh
make tangle && make safe-stow
#+end_src

- Set up Flatpak bridge (fonts + cursors)
#+begin_src sh
make bridge-flatpak
# verify:
flatpak override --user --show | grep -E 'FONTCONFIG_FILE|XCURSOR_PATH' || true
#+end_src

- Apply/repair X11 session bits (cursor path)
#+begin_src sh
make x11-apply
#+end_src

** What each powered feature actually does

*** Safe Stow (=safe-stow=)
- Runs =stow -n= on packages (=all linux debian think=) to **detect** files that aren’t symlinks yet.
- For each real file it would overwrite, copies a timestamped backup:
  =~/path/file.bak-YYYYmmdd-HHMMSS=
- Then runs =stow PKG= for each package in order.

Verify:
#+begin_src sh
readlink -f ~/.xsessionrc
ls -l ~/.local/bin/flatpak-desktop-bridge
#+end_src

Rollback (per file):
#+begin_src sh
mv ~/.xsessionrc.bak-YYYYmmdd-HHMMSS ~/.xsessionrc
#+end_src

*** X11 apply (=x11-apply=)
- Re-tangles (idempotent), stows =think=, and ensures your merged =~/.xsessionrc= contains:
  - your original GTK_CSD/LD_PRELOAD logic, and
  - a **non-clobbering** cursor search path:
    =XCURSOR_PATH=$HOME/.icons:/usr/local/share/icons:/usr/share/icons=

Verify:
#+begin_src sh
sed -n '1,80p' ~/.xsessionrc
printenv XCURSOR_PATH || echo "(will be set on next X session start)"
#+end_src

*** Flatpak bridge (fonts + cursors) (=bridge-flatpak=)
- Tangle+stow first (keeps scripts/configs current).
- Points all Flatpaks at a versioned fonts config:
  - =FONTCONFIG_FILE=${HOME}/.dotfiles/linux/.flatpak/fontconfig/fonts.conf=
  - That config includes:
    - your user fonts: =/home/metsatron/.local/share/fonts= (and legacy =~/.fonts= if used)
    - host fonts via the Flatpak bridge: =/run/host/usr/share/fonts= and =/run/host/usr/local/share/fonts=
- Exposes cursors to Flatpaks dynamically (no theme is forced):
  - =XCURSOR_PATH=$HOME/.icons:/run/host/usr/local/share/icons:/run/host/usr/share/icons=
- Unsets =LD_PRELOAD= inside Flatpaks to avoid host leakage.

Verify:
#+begin_src sh
flatpak override --user --show | grep -E 'FONTCONFIG_FILE|XCURSOR_PATH' || true
sed -n '1,40p' ~/.dotfiles/linux/.flatpak/fontconfig/fonts.conf

# Inside apps:
flatpak run --command=sh md.obsidian.Obsidian -c \
  'fc-cache -f >/dev/null 2>&1; fc-match "SFMono Nerd Font"; fc-match "SFMono Nerd Font Mono"'
flatpak run --command=sh one.ablaze.floorp -c 'fc-match "SFMono Nerd Font"'
flatpak run --command=sh one.ablaze.floorp -c 'echo $XCURSOR_PATH'
#+end_src

Expected:
- You see =SFMonoNerdFont-*.otf= matches in both apps.
- =XCURSOR_PATH= shows your user icons plus host icon dirs.

*** Flatpak bridge reset (=bridge-flatpak-reset=)
- Removes only the overrides the bridge set:
  - Unsets =FONTCONFIG_FILE= and =XCURSOR_PATH= at =--user= scope.
  - Removes any per-app env bindings added by the bridge.
- Does **not** touch your fonts or icons on disk.

Verify:
#+begin_src sh
flatpak override --user --show | grep -E 'FONTCONFIG_FILE|XCURSOR_PATH' || true
#+end_src

*** Guix targets (=guix-*=)
- =guix-core=: =tangle= → ensure =~/.guix-extra-profiles/core= → build from =$(GUIX_HOME)/manifests/core.scm=
- =guix-dev=: depends on =guix-core= → builds =~/.guix-extra-profiles/dev=
- =guix-pull=: =guix pull=
- =guix-gc=: =guix gc=
- =guix-dirs=: runs =~/.local/bin/guix-mkdirs= if present

** Preview / Dry runs
Preview files stow would touch:
#+begin_src sh
make preview-stow
#+end_src

** Troubleshooting

- Emacs “no version information available (libxml2)”
  This is benign on mixed Guix/Ubuntu setups; batch Emacs still runs. To silence it, align libxml2 versions or use a non-Guix Emacs for tangling.

- Fonts inside Flatpaks still resolve to DejaVu
#+begin_src sh
make bridge-flatpak
flatpak run --command=sh md.obsidian.Obsidian -c \
  'fc-cache -f >/dev/null 2>&1; FC_DEBUG=4 fc-match "SFMono Nerd Font"'
#+end_src
Check that =/home/metsatron/.local/share/fonts= is listed and =FONTCONFIG_FILE= points into =.dotfiles/linux/.flatpak/...=.

- Cursor theme not picked by some apps
Flatpaks see =XCURSOR_PATH=; the actual theme is chosen by the host. Ensure the selected theme exists in =~/.icons= or =/usr/share/icons=. We intentionally **don’t** set =XCURSOR_THEME= globally to keep it dynamic.

** Rollback patterns

- Undo stow for a package:
#+begin_src sh
(cd ~/.dotfiles && stow -D think)
#+end_src

- Restore a single file from a backup created by =safe-stow=:
#+begin_src sh
mv ~/.xsessionrc.bak-YYYYmmdd-HHMMSS ~/.xsessionrc
#+end_src

- Remove Flatpak bridge overrides:
#+begin_src sh
make bridge-flatpak-reset
#+end_src

** Optional: self-documenting help
If you want =make help=:
#+begin_src makefile
.PHONY: help
help:
| @awk 'BEGIN{FS=":.*##"; printf "\nTargets:\n"} \
/^[a-zA-Z0-9_.-]+:.*##/{printf "  \033[36m%-22s\033[0m %s\n", $$1, $$2}' $(MAKEFILE_LIST)
#+end_src

Annotate targets like:
#+begin_src makefile
safe-stow: ## Backup real files (timestamp) and stow all linux debian think
#+end_src

* 🔁 Bootstrap Script
Use =scripts/orgify_dotfiles.py= to create one Org file per existing config, with the file's current content wrapped in a block that tangles back to the original path. This is *non-destructive* and helps you start moving commentary into Org.

* 📦 Org Publish (optional)
Configure an =org-publish= project to export a browsable site for your dotfiles. See =scripts/dotfiles-batch.el=.

* OS Config Documentations


* Templates Directory

The `~/Templates/` directory provides structured starter files for use in Thunar's
"Create Document" context menu (or any other file manager that supports XDG Templates).

** Purpose
- Quick creation of new files with prefilled structure
- Cross-OS compatibility (even on systems without Thunar)
- Shared, stowable dotfiles-based templates

** Structure
We maintain a one-level-deep layout to avoid clutter in file manager menus:

#+BEGIN_EXAMPLE
Templates/
  Bash Script.sh
  Zsh Script.zsh
  Plain Text.txt
  README.md
  Obsidian Note.md
  Logseq Note.md
  Code/
  Emacs/
  Notes/
  Media/
  OpenDocument/
  Projects/
#+END_EXAMPLE

** Philosophy
- Keep most universal, OS-level, cross-project files in the *root*.
  - e.g. README.md, Plain Text.txt, Bash Script.sh
- Use subfolders for niche or domain-specific templates.
  - e.g. Code/, Emacs/, Notes/, Media/
- This preserves a clean, practical right-click menu.

** Usage
- Simply add or edit templates in ~/Templates/
- They will appear automatically in Thunar's "Create Document"
- Fully stow-compatible across systems

** Example Command to View Structure
Run from within Templates:

#+BEGIN_SRC bash
tree -a -L 2
#+END_SRC

This will show the top-level and immediate subfolder contents for easy verification.

** Notes
- Executable bits are not preserved when using "Create Document".
  - Scripts will need `chmod +x` after creation.
  - Templates contain correct shebangs for easy editing.
- Designed to be OS-agnostic.
  - Works on Linux (Thunar, Dolphin)
  - Safe to store on macOS, Windows, WSL
  - Can be used with CLI tooling
